In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
lidf = []
for i in range(2006,2018):
    df = pd.read_html('http://www.cpzhan.com/liu-he-cai/all-results/?year={}&sort=seq'.format(i), header=0)
    lidf.append(df[0])
df_concat = pd.concat(lidf)
df_concat.columns = ['year','index','date','N1', 'N2', 'N3', 'N4', 'N5', 'N6','S1']
df_concat.tail()

     year  index        date  N1  N2  N3  N4  N5  N6  S1
148  2017    149  2017-12-21  47  30  21  28  14  22   3
149  2017    150  2017-12-24  34  39  47   1  16  26  11
150  2017    151  2017-12-26  37   2   7  30  16  28  12
151  2017    152  2017-12-28  46  15  40  44  17  23  11
152  2017    153  2017-12-30  13   1  25  38  36  22  37

In [37]:
df_concat.to_csv('2006_2017_raw.csv', index=False)

In [4]:
def func_1(s1):
    
    cdict = {'red':[1,2,7,8,12,13,18,19,23,24,29,30,34,35,40,45,46],
        'blue':[3,4,9,10,14,15,20,25,26,31,36,37,41,42,47,48],
        'green':[5,6,11,16,17,21,22,27,28,32,33,38,39,43,44,49]}
    
    if s1 in cdict['red']:
        return 'red'
    elif s1 in cdict['blue']:
        return 'blue'
    else:
        return 'green'

In [34]:
def generate_zodiac(year):
    
    sign = np.nan
    
    if (year - 2000) % 12 == 0:
        sign = 'dragon'
    elif (year - 2000) % 12 == 1:
        sign = 'snake'
    elif (year - 2000) % 12 == 2:
        sign = 'horse'
    elif (year - 2000) % 12 == 3:
        sign = 'goat'
    elif (year - 2000) % 12 == 4:
        sign = 'monkey'
    elif (year - 2000) % 12 == 5:
        sign = 'rooster'
    elif (year - 2000) % 12 == 6:
        sign = 'dog'
    elif (year - 2000) % 12 == 7:
        sign = 'pig'
    elif (year - 2000) % 12 == 8:
        sign = 'rat'
    elif (year - 2000) % 12 == 9:
        sign = 'ox'
    elif (sign - 2000) % 12 == 10:
        sign = 'tiger'
    else:
        sign = 'rabbit'
        
    zdlist = ['rat','pig','dog','rooster','monkey','goat','horse','snake','dragon','rabbit','tiger','ox']*2
    seq_list = zdlist[zdlist.index(sign):zdlist.index(sign)+12]
    
    zodiac = {}
    mat = np.arange(1,49).reshape(4,12).transpose().tolist()
    mat[0].append(49)
    
    for num, key in enumerate(seq_list):
        
        zodiac[key] = mat[num]
    
    return zodiac

In [6]:
def func_2(year, s1):
    
    zodiac = generate_zodiac(year)
    
    if s1 in zodiac['rat']:
        return 'rat'
    elif s1 in zodiac['ox']:
        return 'ox'
    elif s1 in zodiac['tiger']:
        return 'tiger'
    elif s1 in zodiac['rabbit']:
        return 'rabbit'
    elif s1 in zodiac['dragon']:
        return 'dragon'
    elif s1 in zodiac['snake']:
        return 'snake'
    elif s1 in zodiac['horse']:
        return 'horse'
    elif s1 in zodiac['goat']:
        return 'goat'
    elif s1 in zodiac['monkey']:
        return 'monkey'
    elif s1 in zodiac['rooster']:
        return 'rooster'
    elif s1 in zodiac['dog']:
        return 'dog'
    else:
        return 'pig'

In [7]:
def func_3(s1):
    
    if s1 % 2 == 0:
        return 'even'
    else:
        return 'odd'

In [8]:
def func_4(s1):
    
    if s1 >= 25:
        return 'big'
    else:
        return 'small'

In [9]:
df_concat['color'] = df_concat['S1'].apply(func_1)

In [35]:
df_concat['zodiac'] = df_concat.apply(lambda x: func_2(x['year'], x['S1']), axis=1)

In [13]:
df_concat['EvO'] = df_concat['S1'].apply(func_3)

In [14]:
df_concat['BS'] = df_concat['S1'].apply(func_4)

In [24]:
df_concat.groupby('year')['year'].count()

year
2006    154
2007    152
2008    149
2009    154
2010    152
2011    154
2012    152
2013    152
2014    152
2015    152
2016    151
2017    153
Name: year, dtype: int64

In [36]:
df_concat[df_concat['year']==2009].tail()

,year,index,date,N1,N2,N3,N4,N5,N6,S1,color,zodiac,EvO,BS
149,2009,150,2009-12-22,33,6,44,23,30,43,10,blue,dragon,even,small
150,2009,151,2009-12-24,20,22,27,26,44,31,49,green,ox,odd,big
151,2009,152,2009-12-26,42,27,21,17,36,6,23,red,rabbit,odd,small
152,2009,153,2009-12-29,33,39,9,38,27,40,14,blue,rat,even,small
153,2009,154,2009-12-31,33,26,28,41,31,40,19,red,goat,odd,small

In [38]:
df_concat['date'] = pd.to_datetime(df_concat['date'])

In [39]:
df_concat.set_index('date', inplace=True)

In [41]:
df_concat['month'] = df_concat.index.month

In [42]:
df_concat.head()

,year,index,N1,N2,N3,N4,N5,N6,S1,color,zodiac,EvO,BS,month
date,,,,,,,,,,,,,,
2006-01-03,2006,1,25,17,38,26,23,24,47,blue,rat,odd,big,1
2006-01-05,2006,2,10,22,46,44,5,38,13,red,dog,odd,small,1
2006-01-08,2006,3,38,26,28,42,10,1,43,green,dragon,odd,big,1
2006-01-10,2006,4,38,39,21,25,36,5,4,blue,goat,even,small,1
2006-01-12,2006,5,15,37,36,24,27,25,35,red,rat,odd,big,1

In [43]:
df_concat.to_csv('2006_2017_features.csv')